Revit 2026 API

# ApplicationMacroOptions Enumeration

---

The application macro options.

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ApplicationMacroOptions
```
```vb
Public Enumeration ApplicationMacroOptions
```
```cpp
public enum class ApplicationMacroOptions
```
```fsharp
type ApplicationMacroOptions
```

| Member name | Value | Description |
| --- | --- | --- |
| DisableMacros | 1 | The option to disable macros for the application. |
| EnableMacros | 0 | The option to enable macros for the application. |

#### Reference

Autodesk.Revit.DB.Macros Namespace